In [1]:
import numpy as np
import pandas as pd

In [7]:
#create pandas series with 0 to 4 as data and a to d as index
obj=pd.Series(np.arange(4),
              index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [8]:
#simply start from 0 and display 3 datas
obj[:3]

a    0
b    1
c    2
dtype: int32

In [12]:
#here we use two big bracket because we have used two index 
obj[["a", "c"]]

a    0
c    2
dtype: int32

In [13]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [22]:
#show data whose value is less than 2
obj[obj<2]

Series([], dtype: int32)

In [26]:
obj["b":"c"]=5
obj

a    5
b    5
c    5
d    3
dtype: int32

In [32]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),  #series is geting converted into 4*4 matrix
    index =["London","Paris","Berlin","Istanbul"],
    columns =["one", "two", "three", "four"]
)
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [33]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [35]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [36]:
data[:"Berlin"]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [44]:
#only print those value which are greater than five in column four
data[data["four"]>5]

        one  two  three  four
London    0    1      2     3

In [45]:
#change the value to 0 if it is samller than 5

data[data<5]=0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [49]:
#selection with loc and iloc label based indexing and integer based indexing

data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [50]:

data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [52]:
data.loc["Paris"]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [54]:
data.loc["Paris",["two","three","four"]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [57]:
toy_data=pd.Series(np.arange(5),index=['a','b','c','d', 'e'])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [59]:
#negative index indicates the last data of the series, herev we extract the last value
#as the index starts from 0 likewise from the 
toy_data[-1]

4

In [60]:
toy_data[-2]

3

In [61]:
s=pd.Series([1,2,3,4], index=["a", "b", "c", "d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [65]:
#change the index value
#the values were initiallyb int but as we reindex the values are converted to float, this is because the Nan may be anything so it is taken as float 
s2 = s.reindex(["b", "d", "a", "c", "e"])
s2

b    2.0
d    4.0
a    1.0
c    3.0
e    NaN
dtype: float64

In [66]:
s3=pd.Series(["blue", "yellow", "purple"], index=[0,2,4])
s3

0      blue
2    yellow
4    purple
dtype: object

In [68]:
#using Ffill ie forward fill, filss with the nearets value
s3.reindex(range(6), method="ffill")

0      blue
1      blue
2    yellow
3    yellow
4    purple
5    purple
dtype: object

In [69]:
df=pd.DataFrame(
    np.arange(9).reshape(3,3),  #series is geting converted into 4*4 matrix
    index =["a","b","c"],
    columns =["Tim", "Tom", "Kate"]
)
df

   Tim  Tom  Kate
a    0    1     2
b    3    4     5
c    6    7     8

In [70]:
df2=df.reindex(["d","c","b","a"])
df2

   Tim  Tom  Kate
d  NaN  NaN   NaN
c  6.0  7.0   8.0
b  3.0  4.0   5.0
a  0.0  1.0   2.0

In [72]:
names=["Kate", "Tim", "Tom"]
df.reindex(columns=names)

   Kate  Tim  Tom
a     2    0    1
b     5    3    4
c     8    6    7

In [77]:
df.loc[["c","a"]]

   Tim  Tom  Kate
c    6    7     8
a    0    1     2

In [78]:
s=pd.Series(np.arange(5.), index=["a", "b", "c", "d","e"])
s

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [83]:
#dedlete b
new_s=s.drop("b")
new_s

a    0.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [84]:
new_s=s.drop(["c","d"])
new_s

a    0.0
b    1.0
e    4.0
dtype: float64

In [87]:
a=pd.DataFrame(np.arange(16).reshape(4,4),
               index=["Kate", "Tim","Tom","Alex" ],
                    columns=list("ABCD"))
a

       A   B   C   D
Kate   0   1   2   3
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [90]:
#for column axis=1 and for row axis=0
data1=a.drop("A", axis=1)
data1

       B   C   D
Kate   1   2   3
Tim    5   6   7
Tom    9  10  11
Alex  13  14  15

In [91]:
data2=a.drop("Kate", axis=0)
data2

       A   B   C   D
Tim    4   5   6   7
Tom    8   9  10  11
Alex  12  13  14  15

In [92]:
data.mean(axis=0)

one      5.00
two      6.75
three    7.50
four     8.25
dtype: float64

In [93]:
data.mean(axis=1)

London       0.0
Paris        4.5
Berlin       9.5
Istanbul    13.5
dtype: float64